delivery_carrier_label_seur/models/template/picking_info.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://consultaExpediciones.servicios.webseur">
   <soapenv:Header/>
   <soapenv:Body>
      <con:consultaExpedicionesStr>
         <con:in0>${expedicion}</con:in0>
         <con:in1></con:in1>
         <con:in2></con:in2>
         <con:in3>${reference}</con:in3>
         <con:in4></con:in4>
         <con:in5></con:in5>
         <con:in6></con:in6>
         <con:in7></con:in7>
         <con:in8></con:in8>
         <con:in9></con:in9>
         <con:in10></con:in10>
         <con:in11>${service}</con:in11>
         <con:in12>${username}</con:in12>
         <con:in13>${password}</con:in13>
         <con:in14>${public}</con:in14>
      </con:consultaExpedicionesStr>
   </soapenv:Body>
</soapenv:Envelope>
